{
"hymn": 155,
"title": "ENTHRONE JESUS AS KING",
"bible_ref": "He is the Lord of Lord and King of kings. Rev. 17:13",
"key": "C",
"verses": [
"O how great the burden in God's heart is so deep=For His will and His purpose on earth.=Daily His heart groans and weeps bitterly,=As many souls dwell in the darkness of sin;=Nations perishing without Jesus.=How thoughtless to watch, folding our arms;=But yet desire God in their lives to rule;=We must rise to enthrone Jesus as King.",
"Why seated though time flies and souls go to hell,=Sealing their doom despite the cross?=Jesus His glory left and died to save us;=Why count the cost to take Jesus to men?=What account have you before God to give?=Where are the crowns at His feet to lay?=This generation daily in sin groans,=Needing Jesus to be enthroned as King.",
"Jesus in this world of sin must be enthroned;=In spite of hells opposition and wrath.=Though Satan in his prison men's heart has chained;=Sufficient to save is the Arm of our God.=In His strength labour I, while it is day;=Seeking through tribes and cultures for souls;=Across mountains, valleys, oceans with light:=Until Jesus as their king is enthroned.",
"By wishful thought Jesus cannot be enthroned;=Neither through comfort, convenience nor dreams.=Self knowledge and wisdom cannot enthrone Him:=Unless transformed life, abiding in Christ,=And deliberate labour bearing the cross,=By prayer and fasting, groaning with faith:=Satan barriers will surely give way.=So is Jesus in our life time enthroned.",
"Though great and mighty be the task before me,=Yet fear not I, for my help is the LORD,=From my flesh daily oh Lord, deliver me,=That I in thy grace and mercy rely;=Before thee lay I for thy touch divine;=By-pass me not in this glorious labour.=Here I am, LORD, ready for thee to use,=In my days to enthrone Jesus as King."],
"chorus": "Go Labour on and be spent for God;=With all that we have we must go forth.=In pursuit of this one precious goal:=Enthroning Jesus in this generation as King=Until men in righteousness to Him shall bow=In sweet adoration eternally.",
"meta_text": "Peace House Singing Team, Gboko",
"meta_music": "Peace House Singing Team, Gboko",
"meta_up": "",
"meta_down": ""
}